<a href="https://colab.research.google.com/github/SANGSEOSEO/philosophy_datascience/blob/master/%5B%EC%8B%A4%EC%8A%B5%5DCh02_pandas_%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%A0%84%EC%B2%98%EB%A6%AC_10_arithmathics_of_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

## 예제 DataFrame 생성

In [2]:
data_Dic = {
          '통계': [60, 70, 80, 85, 75],
          '미술': [50, 55, 80, 100, 95],
          '체육': [70, 65, 50, 95, 100]
}
df = pd.DataFrame(data_Dic)

In [3]:
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

## 1. Column 과 Column 간 연산 (+, -, *, /, %)

In [ ]:
type(df['통계']), type(df['미술'])

(pandas.core.series.Series, pandas.core.series.Series)

In [4]:
df['미술'] + df['체육'] + df['통계']

0    180
1    190
2    210
3    280
4    270
dtype: int64

In [5]:
df['체육'] - df['통계']

0    10
1    -5
2   -30
3    10
4    25
dtype: int64

In [ ]:
df['통계'] + df['미술']

0    110
1    125
2    160
3    185
4    170
dtype: int64

In [6]:
# 나누기
df['통계'] / df['미술']

0    1.200000
1    1.272727
2    1.000000
3    0.850000
4    0.789474
dtype: float64

In [ ]:
# 코드를 입력해 주세요
df['체육'] - df['통계']

0    10
1    -5
2   -30
3    10
4    25
dtype: int64

## 2. Column 과 숫자 간 연산 (+, -, *, /, %)

In [38]:
# scalar연산이 모든 요소에 broadcasting
df['통계'] + 10

0    70.0
1    80.0
2     NaN
3    95.0
4    85.0
Name: 통계, dtype: float64

In [39]:
df['통계'] * 10

0    600.0
1    700.0
2      NaN
3    850.0
4    750.0
Name: 통계, dtype: float64

In [40]:
# 몫
df['통계'] / 10

0    6.0
1    7.0
2    NaN
3    8.5
4    7.5
Name: 통계, dtype: float64

In [41]:
# 나머지
df['통계'] % 10

0    0.0
1    0.0
2    NaN
3    5.0
4    5.0
Name: 통계, dtype: float64

## 3. 복합 연산

In [42]:
data_Dic = {
          '통계': [60, 70, 80, 85, 75],
          '미술': [50, 55, 80, 100, 95],
          '체육': [70, 65, 50, 95, 100]
}

df = pd.DataFrame(data_Dic)

In [44]:
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [45]:
# 컬럼 생성
df['통계미술합계'] = df['미술'] + df['통계'] + 10

In [46]:
df

   통계   미술   체육  통계미술합계
0  60   50   70     120
1  70   55   65     135
2  80   80   50     170
3  85  100   95     195
4  75   95  100     180

In [ ]:
df['통계'] + df['미술'] - df['체육']

0     40
1     60
2    110
3     90
4     70
dtype: int64

In [10]:
df.mean(axis = 0)

통계    74.0
미술    76.0
체육    76.0
dtype: float64

In [11]:
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [12]:
df.mean(axis=1)

0    60.000000
1    63.333333
2    70.000000
3    93.333333
4    90.000000
dtype: float64

In [ ]:
df

   통계   미술   체육  전체 합  통계평균
0  60   50   70   180  74.0
1  70   55   65   190  74.0
2  80   80   50   210  74.0
3  85  100   95   280  74.0
4  75   95  100   270  74.0

## 4. mean(), sum()을 axis 기준으로 연산

In [ ]:
df = pd.DataFrame(data_Dic)

In [ ]:
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [47]:
# 행에 대한 전체 합
df.sum(axis=0)

통계        370
미술        380
체육        380
통계미술합계    800
dtype: int64

In [48]:
# 열들에 대한 합
df.sum(axis=1)

0    300
1    325
2    380
3    475
4    450
dtype: int64

In [ ]:
df.mean(axis=0)

통계    74.0
미술    76.0
체육    76.0
dtype: float64

In [13]:
df.mean(axis=1)

0    60.000000
1    63.333333
2    70.000000
3    93.333333
4    90.000000
dtype: float64

## 5. NaN 값이 존재할 경우 연산

*   NaN이 포함된 연산은 무조건 NaN이다.

In [49]:
data_Dic = {
    '통계': [60, 70, np.nan , 85, 75], 
    '미술': [50, np.nan , 80, 100, 95], 
    '체육': [70, 65, 50, np.nan , 100]
}
df = pd.DataFrame(data_Dic)

In [50]:
df

     통계     미술     체육
0  60.0   50.0   70.0
1  70.0    NaN   65.0
2   NaN   80.0   50.0
3  85.0  100.0    NaN
4  75.0   95.0  100.0

In [51]:
df['통계'] / 2

0    30.0
1    35.0
2     NaN
3    42.5
4    37.5
Name: 통계, dtype: float64

In [52]:
1000 / df['통계']

0    16.666667
1    14.285714
2          NaN
3    11.764706
4    13.333333
Name: 통계, dtype: float64

In [53]:
df['통계'] / np.nan

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 통계, dtype: float64

In [54]:
np.nan / df['통계']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 통계, dtype: float64

## 6. DataFrame 과 DataFrame 간 연산
  - 연산 전에 문자열이 포함되어 있는지 확인 필요
  - NaN값에 대한 전처리가 필요하다면 해야 함.
  - 연산이 필요한 데이터 프레임간에 문자가 들어가 있다면 이에 대한 전처리 필요

In [22]:
df1_Dic = {
              '통계': [60, 70, 80, 85, 75], 
              '미술': [50, 55, 80, 100, 95], 
              '체육': [70, 65, 50, 95, 100] 
          }
df1 = pd.DataFrame(df1_Dic)

In [23]:
df2_Dic = {
          '통계': ['good', 'bad', 'ok' , 'good', 'ok'], 
          '미술': [50, 60 , 80, 100, 95], 
          '체육': [70, 65, 50, 70 , 100] }
df2 = pd.DataFrame(df2_Dic)

In [24]:
df1

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [ ]:
# 문제가 되는 컬럼 삭제
df2.drop(lables='통계', axis=1, inplace=True)

In [27]:
df2

    미술   체육
0   50   70
1   60   65
2   80   50
3  100   70
4   95  100

In [26]:
# 문자열이 들어가있는 로우 삭제 
# labels : 삭제하고자 하는 컬럼
# axis=1 은 삭제하고자 하는 축(여기서는 컬럼)
# inplace=True는 원본 데이터프레임에 바로 반영
df2.drop(labels='통계', axis=1, inplace=True)

`'통계'`항목을 삭제 후 문자열이 포함된 DataFrame의 경우

In [ ]:
(df1 + df2).fillna(0)

    미술   체육   통계
0  100  140  0.0
1  115  130  0.0
2  160  100  0.0
3  200  165  0.0
4  190  200  0.0

문자열이 포함된 DataFrame의 브로드캐스팅 연산

In [55]:
df1 + 10

   미술   통계
0  20   70
1  30   80
2  40   90
3  50  100
4  60  110
5  70  120

In [56]:
df2 + 10  # 문자열이 들어있는 행을 삭제 후 연산 가능

   통계   미술
0  20   70
1  30   80
2  40   90
3  50  100
4  60  110

column의 순서가 바뀌어 있는 경우

In [30]:
df1 = pd.DataFrame({'미술': [10, 20, 30, 40, 50], '통계':[60, 70, 80, 90, 100] })
df2 = pd.DataFrame({'통계': [10, 20, 30, 40, 50], '미술': [60, 70, 80, 90, 100] })

In [31]:
df1

   미술   통계
0  10   60
1  20   70
2  30   80
3  40   90
4  50  100

In [32]:
df2

   통계   미술
0  10   60
1  20   70
2  30   80
3  40   90
4  50  100

In [33]:
df1 + df2   # 컬럼에 맞춰서 연산해줌

    미술   통계
0   70   70
1   90   90
2  110  110
3  130  130
4  150  150

**행의 갯수가 다른경우**

In [36]:
df1_dic = {'미술': [10, 20, 30, 40, 50, 60], '통계':[60, 70, 80, 90, 100, 110] }
df2_dic = {'통계': [10, 20, 30, 40, 50], '미술': [60, 70, 80, 90, 100] }
df1 = pd.DataFrame(df1_dic)
df2 = pd.DataFrame(df2_dic)

In [37]:
# 누락된 행이 있으면 그 부분의 연산은 NaN
df1 * df2

       미술      통계
0   600.0   600.0
1  1400.0  1400.0
2  2400.0  2400.0
3  3600.0  3600.0
4  5000.0  5000.0
5     NaN     NaN